{
    "index": {
        "9": 11,
        "10": 12,
        "11": 14,
        "12": 15
    },
    "file_path": {
        "9": "./pages/Guernsey/revisions",
        "10": "./pages/Jersey/revisions",
        "11": "./pages/about/revisions",
        "12": "./pages/codeofconduct/revisions"
    },
    "date": {
        "9": "",
        "10": "",
        "11": "",
        "12": ""
    },
    "place": {
        "9": "",
        "10": "",
        "11": "",
        "12": ""
    },
    "agenda": {
        "9": "",
        "10": "",
        "11": "",
        "12": ""
    },
    "notes": {
        "9": "",
        "10": "",
        "11": "",
        "12": ""
    },
    "resources": {
        "9": "",
        "10": "",
        "11": "",
        "12": ""
    },
    "attended": {
        "9": "",
        "10": "",
        "11": "",
        "12": ""
    },
    "content": {
        "9": "= Guernsey =\n\nNothing here yet. \n\nIf you're from Guernsey and want to take ownership of your side of the CIPug then please get in touch - rcwd@cipug.org\n",
        "10": "= Jersey =\n\nThe Jersey chapter is currently running a monthly meet up, collaborating on a channel on the Tech Tribes Slack group and actively seeking new Python developers of all levels from across the island.\n\n== Get Updated ==\n\nTo keep up to date on all things Python in Jersey please consider joining our [[https://lists.cipug.org/mailman/listinfo|very low traffic mailing list]]. \n\n== Upcoming Meet Ups / Events ==\n\n[[2019-11-november-jersey-meetup| 2019-11-?? - October Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n== Previous Meet Ups / Events ==\n\n[[2019-10-october-jersey-meetup| 2019-10-24 - October Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n[[2019-09-september-jersey-meetup| 2019-09-?? - September Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n[[2019-08-august-jersey-meetup| 2019-08-29 - August Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n[[2019-07-july-jersey-meetup| 2019-07-31 - July Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n[[2019-06-june-jersey-meetup| 2019-06-26 - June Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n[[2019-05-may-jersey-meetup| 2019-05-23 - May Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n[[2019-04-24-april-jersey-meetup|2019-04-24 - April Jersey Meetup]]\nfrom 17:30 at Unit 13, Le Capelain House, Castle Quay.\n\n[[2019-03-26-march-jersey-meetup|2019-03-26 - March Jersey Meetup]]\nfrom 17:30 in the Digital Jersey Hub\n\n[[2019-02-21-initial-jersey-meetup|2019-02-21 - Initial Jersey Meetup]]\nfrom 17:30 in the Digital Jersey Hub\n",
        "11": "= About CIPUG =\n\nFounded in March 2019, the Channel Islands Python User Group is a monthly meet up for users of the Python programming language.\n\nWe welcome users of all levels, from beginner to expert, into a safe, fun and social forum to share ideas & tools, ask and give advice, and generally improve and promote Python use across the islands.\n\nFor more information on upcoming meet ups check the [[jersey|meetups]] page or feel free to drop an email to rcwd@cipug.org.\n\n----\n\nNote currently the Jersey chapter is fully up and running, Guernsey is still under construction but should be online soon.\n",
        "12": "= Channel Islands Python User Group Code of Conduct =\n\nThe Channel Islands Python User Group (CIPUG) community is made up of members from a range of different backgrounds with a diverse set of skills, personalities, and experiences. It is through these differences that our community experiences great successes and continued growth. When you're working with members of the community, we encourage you to follow these guidelines which help steer our interactions and strive to keep ours a positive, successful, and growing community.\n\nA member of the CIPUG community is:\n\n'''Open'''\n\nMembers of the community are open to collaboration, whether it's on projects, demos, problems, or otherwise. We're receptive to constructive comment and criticism, as the experiences and skill sets of other members contribute to the whole of our efforts. We're accepting of all who wish to take part in our activities, fostering an environment where anyone can participate and everyone can make a difference.\n\n'''Considerate'''\n\nMembers of the community are considerate of their peers -- other Python users. We're thoughtful when addressing the efforts of others, keeping in mind that often times the labor was completed simply for the good of the community. We're attentive in our communications, whether in person or online, and we're tactful when approaching differing views.\n\n'''Respectful'''\n\nMembers of the community are respectful. We are respectful of others, their positions, their skills, their commitments, and their efforts. We are respectful of the volunteer efforts that permeate user group and the wider Python community. We're respectful of the processes set forth in the community, and we work within them. When we disagree, we are courteous in raising our issues.\n\nOverall, we're good to each other. We contribute to this community not because we have to, but because we want to. If we remember that, these guidelines will come naturally.\n\nExamples of behaviour that contributes to creating a positive environment include:\n\n * Being kind to others\n * Behaving professionally\n * Using welcoming and inclusive language\n * Being respectful of differing viewpoints and experiences\n * Gracefully accepting constructive criticism\n * Focusing on what is best for the community\n * Showing empathy towards other community members\n\nExamples of unacceptable behaviour by participants include:\n\n * Harassment of conference participants in any form\n * Deliberate intimidation, stalking, or following\n * Violent threats or language directed against another person\n * Sexual language and imagery in any conference venue, including talks\n * Insults or put downs\n * Sexist, racist, homophobic, transphobic, ableist, or exclusionary jokes\n * Unwelcome sexual attention or advances\n * Unwelcome physical contact\n * Sustained disruption of events\n * Other conduct that is inappropriate for a professional group including people of many different backgrounds\n\nMembers asked to stop any inappropriate behaviour are expected to comply immediately.\n\nIf a member engages in behaviour that violates this code of conduct, the CIPUG organisers may take any action they deem appropriate, including warning the offender or temporary or permanent expulsion from the group.\n\n== Scope ==\n\nAll CIPUG Members are subject to the Code of Conduct when engaged in any CIPUG related activity. This includes meet-ups, hackathons, online chat whether private or public, email exchanges and face to face interaction. The Code of Conduct applies equally to all members regardless of duration of membership or other professional or personal affiliation.\n\n== Contact Details ==\n\nThank you for helping make this a welcoming, friendly community for all.\n\nQuestions/comments/reports? Please write to coc@cipug.org. \n\n== Version History ==\n\n * 2019-07-01 - v1.0.0 - initial version\n\nNote: this document is based on a combination of the [[https://www.python.org/psf/codeofconduct/|Python Software Foundation Code of Conduct]] and the [[https://us.pycon.org/2019/about/code-of-conduct/|PyCon US Code of Conduct]].\n"
    }
}